[
    {
        "message_id": 2538,
        "date": "2025-04-20 17:43:50",
        "sender_id": -1001455913405,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Hello everyone, in the past, we have been scheduling our signals to be posted at a specific time which allowed us to get massive volumes and high percentage gains very quickly. This strategy has worked for us many times in the past and allowed our members to generate millions of $ in profits over the last few years. However, the market has changed lately and we realize we need to change our strategy.\n\nFrom now on, all our signals will be posted at random times without any prior notice. Whenever we see a good buying opportunity in the market, we will post it and allow our members to generate great profits quickly as well. This will allow our members to get a better entry in all our signals and allow the signals to grow organically with the market. Our team will be actively supporting all our signals as well to maximize profits for our community.\n\nStay tuned.",
        "reply_to": null
    },
    {
        "message_id": 2537,
        "date": "2025-04-13 17:22:38",
        "sender_id": -1001455913405,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Seems like binance/bybit bots dumped on us somehow or we got mass shorted on. Open interest remains unchanged which is even weirder , it is looking like the price went down without anyone selling. Volume was decent and could have been used towards something better. Doing a futures pump signal was probably a bad idea when Cexs like Binance are currently constantly dumping on users by switching their algos to sell mode but we had to test it out at least and now we know the result.\n\nWe are going to switch our operations to on chain instead and start doing signals there rather than on CEXs, we can most likely generate a lot more profits there for our community, specially since lately this is where most of the action has been. Stay tuned.",
        "reply_to": null
    },
    {
        "message_id": 2536,
        "date": "2025-04-13 16:00:21",
        "sender_id": -1001455913405,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "The coin we are buying today is :  COS \n\nBuy and hold for massive profits.",
        "reply_to": null
    },
    {
        "message_id": 2535,
        "date": "2025-04-13 15:58:13",
        "sender_id": -1001455913405,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "🚨 2 min. Be ready to strike.",
        "reply_to": null
    },
    {
        "message_id": 2534,
        "date": "2025-04-13 15:45:42",
        "sender_id": -1001455913405,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "🕒 15 minutes left\n\n📈 - Sign up to the exchange\n📱 - Send USDT to your wallet.\nℹ️ - Practice using the search bar, buy and sell forms. \n💻 - Open Telegram at 45",
        "reply_to": null
    },
    {
        "message_id": 2533,
        "date": "2025-04-13 15:33:40",
        "sender_id": -1001455913405,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "🕧 30 minutes left",
        "reply_to": null
    },
    {
        "message_id": 2532,
        "date": "2025-04-13 15:00:32",
        "sender_id": -1001455913405,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Only 1 hour left until the big futures signal!",
        "reply_to": null
    },
    {
        "message_id": 2531,
        "date": "2025-04-13 12:02:39",
        "sender_id": -1001455913405,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "4 hours left until the massive buy signal! We will be buying a coin in the futures market using USDT. \n\nThe main exchanges we will be using are Binance and Bybit. \n\nYou will also be able to buy the coin on a few other exchanges such as Gate, Bitget, mexc.  \n\nExpect big gains.",
        "reply_to": null
    },
    {
        "message_id": 2530,
        "date": "2025-04-13 10:36:27",
        "sender_id": -1001455913405,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Massive futures buy signal in: 5h 25min",
        "reply_to": null
    },
    {
        "message_id": 2529,
        "date": "2025-04-11 13:49:32",
        "sender_id": -1001455913405,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Our vip group opens its doors 🚪 \n\nUp to 5 minutes of advantage with the guaranteed. 💎\nAsk to join the group to be contacted or contact @WilliamDrey directly.",
        "reply_to": null
    },
    {
        "message_id": 2528,
        "date": "2025-04-11 13:45:59",
        "sender_id": -1001455913405,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Only 2 days left until the massive futures signal drops\nThis is a major opportunity, especially with most coins currently showing strong buy signals.\n\nThe coin we’ll target will be listed on the futures markets of most major exchanges but we highly recommend using Binance or Bybit to catch this signal at the right moment.",
        "reply_to": null
    },
    {
        "message_id": 2527,
        "date": "2025-04-08 22:00:53",
        "sender_id": -1001455913405,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Signal Announcement - Sunday, April 13, 2025 | 16:00 GMT\n\nWe’re back with powerful coin signals and this time, we’re going futures. \nAfter years of success in spot trading (up to 2000% gains), we’re shifting to where the volume is now.\n\nExchanges: Binance, Bybit + more\nAdvantage: Free for all\nCoins: Strong fundamentals, high liquidity\n\n5 days to go. \nThis one’s going to be big.",
        "reply_to": null
    },
    {
        "message_id": 2526,
        "date": "2025-04-07 16:40:23",
        "sender_id": -1001455913405,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "💬 Statement by Larry Fink, CEO of BlackRock:\n\n- In the long run, this is more of a buying opportunity than a selling opportunity.\n- The White House's actions could be far more inflationary than the market expects.\n- I still haven't ruled out another 20% market decline.\n- The Fed is unlikely to cut interest rates four or five times this year.\n- An interest rate hike is possible this year.\n- The economy is currently weakening.\n- Tariffs will weaken the US dollar.",
        "reply_to": null
    },
    {
        "message_id": 2525,
        "date": "2025-04-07 16:17:21",
        "sender_id": -1001455913405,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Bitcoin is back above $80,000.",
        "reply_to": null
    },
    {
        "message_id": 2524,
        "date": "2025-04-07 16:04:06",
        "sender_id": -1001455913405,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": null,
        "reply_to": 2523
    },
    {
        "message_id": 2523,
        "date": "2025-04-07 16:04:02",
        "sender_id": -1001455913405,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "📝TUTORIAL : How to pump for Dummies ?\n\n🖋 STEP 1 :\nBe sure to sign up on Binance transfer funds. The transfer can take a while so be prepared and do it as soon as possible.\n\n📢STEP 2 : \nWhen the coin is announced, in order to make the maximum of profits you have to buy as fast as possible. The price will rise up quickly, because all the WSB will want to buy the coin to the lowest price. \n\n💡STEP 3 : \n(Tips) Place your buy order a little bit more than the current price in order to be sure to buy the coin. If you place your buy order too low, you might not be able to buy the coin.(Be sure to NOT buy the coin too expensive, we can not control every buy orders so be prudent and do not take too much risk. Our goal is to make you w profits so DO NOT BE GREEDY!).\n\n⚙️SCENARIO : \nLet's say the current price's coin is between 200sats and 208sats. If you place your buy order at 200sats, you can be pratically sure you will not be able to buy the coin. Demands will be strong and the price will naturally rise up. In the other side, if you place you buy order between 210sats and 215sats (even at 220-225sats the deal is pretty good), you will have better chance to buy the coin. \nYou have to know that during a pump the coin's price can easily exceed 50% of his value, with an average of 80% (we already saw a pump with a growth about 400%)\n\n💰STEP 4 : \nAs soon as you order is completed, you need to place a sell order. We do not have the power to tell you when you should sell your coin, it's up to you and it depends which price did you get it. \n🚧Do not shit yourself and sell too early but also DO NOT place your sell order to high. If you place your order too high, you might not be able to sell. So be prudent and DO NOT BE GREEDY !🚧\nDo your calcul, place your sell order and make profits, It's E-A-S-Y !\n\n👏🏽STEP 5 : \nShare our Telegram to your friends, bigger we are, bigger profits you will get.\nTell us how much profits did you earn\nTake care yourself, money is nice, health is better !",
        "reply_to": null
    },
    {
        "message_id": 2522,
        "date": "2025-04-06 13:02:15",
        "sender_id": -1001455913405,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Hello everyone, in order to capitalize and maximize the results for our upcoming signal, better market conditions are needed. \n\nThe market is currently not at it's optimal level and for that reason we have decided to postpone the buy signal for 1 more week. Our upcoming futures signal will now be on Sunday 13th of April 2025 instead, it will definitely be worth the wait. \n\nStay tuned.",
        "reply_to": null
    },
    {
        "message_id": 2521,
        "date": "2025-04-05 16:02:08",
        "sender_id": -1001455913405,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "24 hours left until the massive futures buy signal. Tomorrow is a big day!",
        "reply_to": null
    },
    {
        "message_id": 2519,
        "date": "2025-04-04 14:49:53",
        "sender_id": -1001455913405,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Only 2 days left until the massive futures signal drops\nThis is a huge opportunity, especially with most coins currently showing strong buying potential\n\nThe coin we are targeting will be available on the futures market across most major exchanges. We recommend using Binance or Bybit for this signal",
        "reply_to": null
    },
    {
        "message_id": 2518,
        "date": "2025-04-03 23:33:30",
        "sender_id": -1001455913405,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "3 days to go before the massive signal hits!\nThis one’s big. We’re anticipating huge wins for those who are ready.\n\nGet ready to ride the wave full details dropping soon.",
        "reply_to": null
    },
    {
        "message_id": 2517,
        "date": "2025-04-02 13:48:42",
        "sender_id": -1001455913405,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "4 days left until the massive futures signal! \n\nWe are expecting a lot of people to make massive profits on this signal. \n\nStay tuned for more information coming.",
        "reply_to": null
    }
]