[
    {
        "message_id": 22978,
        "date": "2025-05-07 18:04:25",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "The FED just announced no change in interest rates, which was largely expected by the market.\n\nThis neutral stance might initially cause some indecision, but it also removes the fear of further tightening.\n\nStill, without a rate cut, there’s less fuel for a major breakout, and the market could remain volatile as traders digest the news.",
        "reply_to": null
    },
    {
        "message_id": 22977,
        "date": "2025-05-07 17:39:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "RVN analysis:\n\nThe price is currently finding support along a small uptrend line. However, there is a significant downtrend line acting as resistance. For the price to move higher, it must break through this downtrend resistance. If it fails to do so, we may see a new low. This is a no-trade zone, so it's important to monitor the support and resistance lines closely.",
        "reply_to": 22976
    },
    {
        "message_id": 22976,
        "date": "2025-05-07 15:54:49",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "",
        "reply_to": null
    },
    {
        "message_id": 22975,
        "date": "2025-05-07 12:08:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "There’s a significant cluster of liquidity building below the $94,000 level, making it a prime target for a quick wick to flush out leveraged long positions. Given the current market setup and macro events, we expect both upward and downward volatility today.\n\nTraders should be extra cautious—a sudden pump or dump could occur at any moment. Tight risk management is key in this environment.",
        "reply_to": null
    },
    {
        "message_id": 22974,
        "date": "2025-05-07 10:19:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Bitcoin dominance continues its upward movement, with the price reaching the resistance line of the uptrend channel. We can expect some relief starting next week. Altcoins will only see a rally if Bitcoin can break and hold above the $100,000 level.",
        "reply_to": 22956
    },
    {
        "message_id": 22973,
        "date": "2025-05-07 06:01:19",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Bitcoin has bounced back from the support area but has not been able to break the local high. Volatility remains high as we await news on the Federal Reserve's rate decision. If there is a rate cut, we could see a move towards the key level of $100,000. Conversely, if there is no rate cut, we might experience a quick drop to $90,000. Plan your trades accordingly and ensure you use a tight stop loss.",
        "reply_to": 22967
    },
    {
        "message_id": 22972,
        "date": "2025-05-06 17:18:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "RSR Analysis:\n\nThe price has tested the resistance area and subsequently rejected that level. There is an uptrend line that serves as support; a break below this line could lead the price toward the major support area. You may consider opening a short position if the price tests the resistance area again.\n\nSupport Area: $0.00710-$0.00740\n\nResistance Area: $0.00888-$0.00957",
        "reply_to": 22971
    },
    {
        "message_id": 22971,
        "date": "2025-05-06 15:58:11",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "",
        "reply_to": null
    },
    {
        "message_id": 22970,
        "date": "2025-05-06 14:41:12",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "According to the latest data from Glassnode, a remarkable 88% of the total circulating supply of Bitcoin is currently in profit. This means that nearly nine out of every ten Bitcoins held by investors were acquired at prices lower than the current market value.\n\nSuch a high percentage of profitable supply reflects strong bullish sentiment across the market. Historically, when this metric remains elevated, it indicates that long-term holders are sitting on solid gains — often reinforcing confidence and reducing panic selling.",
        "reply_to": null
    },
    {
        "message_id": 22969,
        "date": "2025-05-06 12:37:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Educational Post\n\nWhat Is Market Sentiment?\n\nMarket sentiment is the collective attitude of traders and investors towards a financial asset or market. The concept exists in all financial markets, including cryptocurrencies. Market sentiment does have the power to influence market cycles.\n\nStill, favorable market sentiment doesn't always lead to positive market conditions. Sometimes, strong positive sentiment (it's going to the moon!) may come before a market correction or even a bearish market.\n\nBesides providing insights into market demand, traders can analyze these sentiments to predict potentially profitable trends. Market sentiment doesn't always consider a project's fundamentals, but they might be linked sometimes.\n\nExample: meme coins\n\nMeme coins can help illustrate the concept of market sentiment. Let’s take Dogecoin as an example. A lot of Dogecoin's demand during its bull runs likely came from social media hype (which led to positive market sentiment). \n\nIn other words, many traders and investors bought Dogecoin without considering the project's tokenomics or goals, but only because of the market sentiment. Even a single tweet from a figure like Elon Musk is enough sometimes to cause positive or negative market sentiment.\n\n\nBullish vs. Bearish Sentiment\n\nInvestor sentiment typically falls into two main categories:\n\nBullish sentiment: Traders and investors feel confident that prices will go up. When the market is bullish, people are more likely to buy and hold onto their assets, hoping to make a profit as prices rise.\n\n\nBearish sentiment: Indicates pessimism and expectations of declining prices. In bearish conditions, investors are more likely to sell off holdings or open short positions.\n\nThese two mindsets can exist at the same time in different parts of the market or among different groups of investors, which often causes price swings and uncertainty.",
        "reply_to": null
    },
    {
        "message_id": 22968,
        "date": "2025-05-06 11:08:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "CRV continues to move downward as anticipated after encountering resistance. The price has dropped over 9% from this resistance level. Increase your stop loss to the breakeven point and maintain your short position, as further declines may be expected.\n\nSupport Area: $0.57-$0.59",
        "reply_to": 22959
    },
    {
        "message_id": 22967,
        "date": "2025-05-06 08:53:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Bitcoin is struggling below $95,000, and let's see how it reacts to the FED meeting. The support is weakening, and there is a high chance that we may drop to $90,000. Keep a tight stop loss on all open positions.",
        "reply_to": 22960
    },
    {
        "message_id": 22966,
        "date": "2025-05-05 18:28:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "TST analysis:\n\nPrice is struggling to break above the trendline. There is little strength, and we may see a continuation of the downward movement. It is advisable to wait for some time before making new entries.\n\nSupport Area: $0.057-$0.060",
        "reply_to": 22965
    },
    {
        "message_id": 22965,
        "date": "2025-05-05 15:50:16",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "",
        "reply_to": null
    },
    {
        "message_id": 22964,
        "date": "2025-05-05 12:39:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "",
        "reply_to": null
    },
    {
        "message_id": 22963,
        "date": "2025-05-05 12:07:25",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "MicroStrategy has acquired 1,895 BTC for approximately $180.3 million at an average price of $95,167 per BTC.\n\nAs of May 4, 2025, the company holds a total of 555,450 BTC, acquired for ~$38.08 billion at an average price of $68,550 per BTC.",
        "reply_to": null
    },
    {
        "message_id": 22962,
        "date": "2025-05-05 11:12:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Ethereum (ETH) is performing as anticipated, with the price maintaining its support level. The trendline remains intact, and if the support holds, we can expect a movement towards the next resistance area. However, if the price breaks below the support, it could drop to the $1500 level. If you have long positions open, consider using a stop loss below $1750.",
        "reply_to": 22941
    },
    {
        "message_id": 22961,
        "date": "2025-05-05 09:23:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "LINK continues its downward trend, having dropped over 7% from the trendline. You can move your stop loss to the breakeven point for the short position. The local support remains unchanged, and if it breaks, we may see a move towards the key level of $10.",
        "reply_to": 22943
    },
    {
        "message_id": 22960,
        "date": "2025-05-05 05:22:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Bitcoin started the week with a downward trend, erasing all the gains from Friday's surge. The price is currently testing the support level. The bulls were unable to maintain the key $95,000 level, which has now become a resistance area. Let's see how the US market opens today, as this will determine the next move.",
        "reply_to": 22954
    },
    {
        "message_id": 22959,
        "date": "2025-05-04 17:48:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "CRV analysis:\n\nPrice is testing the resistance area and appears to have rejected from there. You can open a short position at the resistance area with a tight stop loss.\n\nResistance Area: $0.705-$0.745\n\nStop Loss: candle closes above $0.75",
        "reply_to": 22958
    },
    {
        "message_id": 22958,
        "date": "2025-05-04 15:30:29",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "",
        "reply_to": null
    },
    {
        "message_id": 22957,
        "date": "2025-05-04 13:28:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "According to Glassnode, the number of addresses holding 10,000+ XRP has just surged past 300,000 — a strong signal of growing confidence and accumulation among larger holders. \n\nThis uptick suggests that big players are positioning themselves for a potential upside, possibly anticipating major moves or upcoming catalysts in the XRP ecosystem.",
        "reply_to": null
    },
    {
        "message_id": 22956,
        "date": "2025-05-04 11:59:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Bitcoin dominance continues to rise, showing no signs of weakness yet. There is an upward trend channel, and the price needs to break downward to change this trend. This is why altcoins are struggling, with only a slight recovery expected after the upcoming FED meeting.",
        "reply_to": null
    },
    {
        "message_id": 22955,
        "date": "2025-05-04 08:32:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "BONK is gradually approaching the support area. Let's see how the price reacts there. A break below this support area would be bearish and indicate a continuation of the downward movement. Use a tight stop loss when opening long positions.",
        "reply_to": 22944
    },
    {
        "message_id": 22954,
        "date": "2025-05-04 06:08:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "The market is showing choppy movement, and the price signals are mixed due to low volume. We can expect similar movement today, but high volatility may occur next week. It is advisable not to engage in high-leverage trading and to use stop-loss orders for all positions.",
        "reply_to": 22948
    },
    {
        "message_id": 22953,
        "date": "2025-05-03 17:21:24",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "NEAR analysis: \n\nPrice has broken out of the downtrend channel and has retested the line multiple times. A break below $2.30 would be bearish, so it is advisable to use a stop loss for long positions.",
        "reply_to": 22952
    },
    {
        "message_id": 22952,
        "date": "2025-05-03 15:55:40",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "",
        "reply_to": null
    },
    {
        "message_id": 22951,
        "date": "2025-05-03 12:47:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Solana led all blockchains in revenue generation for Q1 2025, showcasing its strong fundamentals beneath the memecoin hype. Despite volatile narratives, SOL’s consistent user activity and robust protocol monetization point to genuine, sustainable growth on the network.",
        "reply_to": null
    },
    {
        "message_id": 22950,
        "date": "2025-05-03 10:36:30",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "CGPT has broken through the resistance area and is now retesting it. You can open a small long position with a stop loss set below the support area.\n\nSupport Area: $0.1170-$0.1215\n\nResistance Area: $0.1450-$0.1520",
        "reply_to": 22928
    },
    {
        "message_id": 22949,
        "date": "2025-05-03 08:56:25",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "NOT rejected by the downtrend resistance line. We may see a test of the support area before future upward movement. You can place your buy orders in this zone and wait. The support and resistance levels remain the same.",
        "reply_to": 22934
    },
    {
        "message_id": 22948,
        "date": "2025-05-03 06:56:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "It's the weekend, and we may see some choppy movement in Bitcoin. Expect high volatility next week as the FED meeting approaches. The support level is now $95,000, and a break below this level could trigger heavy selling.",
        "reply_to": 22942
    },
    {
        "message_id": 22947,
        "date": "2025-05-02 18:13:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "ICP is currently trading at the support zone, and accumulation is happening. The market could move in either direction, so it's better to use a tight stop loss.\n\nSupport Area: $4.45-$4.95 \n\nResistance Area: $6.95-$7.35",
        "reply_to": 22946
    },
    {
        "message_id": 22946,
        "date": "2025-05-02 15:16:13",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "",
        "reply_to": null
    },
    {
        "message_id": 22945,
        "date": "2025-05-02 13:42:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Additionally, there is a notable cluster of coins currently held at a loss in the $95K–$98K range. As Bitcoin approaches this zone, many holders may look to exit at break-even, creating added sell-side pressure. This, combined with potential Long-Term Holder (LTH) distribution, forms a significant resistance zone.\n\nHowever, above $100K, there’s comparatively little supply overhead, meaning fewer coins have a cost basis in that region. If the market can absorb the $95K–$98K selling pressure, it could open the door to relatively clear skies, potentially setting the stage for a new all-time high.",
        "reply_to": null
    },
    {
        "message_id": 22944,
        "date": "2025-05-02 11:58:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "BONK moved towards the resistance area but was rejected. We may see a drop to the support area, where you can open a long position.\n\nSupport Area: $0.00001510-$0.00001560\n\nResistance Area: $0.00001900-$0.00002030",
        "reply_to": 22889
    },
    {
        "message_id": 22943,
        "date": "2025-05-02 09:48:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "LINK is showing signs of weakness and has broken through the support trendline. We might see a move towards the local support area, so let's observe whether the price can hold at this level. The resistance remains unchanged, and you can consider shorting at that point with a tight stop loss.\n\nLocal Support Area: $13.10 - $13.40",
        "reply_to": 22913
    },
    {
        "message_id": 22942,
        "date": "2025-05-02 06:04:29",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Bitcoin gave a bullish break of the rising wedge pattern and daily candle also closed healthy. BTC can make it way to the $98,450 area as a strong resistance with news we can expect some clarity in the market.",
        "reply_to": 22936
    },
    {
        "message_id": 22941,
        "date": "2025-05-01 18:05:10",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "ETH gave a shallow flip of the resistance and now trying to flip the zone completely. Price can easily move towards the next resistance zone. Trendline can additional factor to the up move if market remains stable.\n\nResistance Area  : $2067 - $2104\nSupport Zone : $1760 - $1811",
        "reply_to": 22888
    },
    {
        "message_id": 22940,
        "date": "2025-05-01 12:37:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Long-Term Holder (LTH) spending volumes remain subdued, suggesting that most seasoned investors are continuing to HODL rather than take profits. The overall balance held by this cohort is steadily increasing, with approximately 254,000 BTC crossing the 155-day threshold since the recent price low. Notably, a significant portion of these coins were acquired at levels above $95,000, reflecting growing conviction among long-term participants despite current market uncertainty.",
        "reply_to": null
    },
    {
        "message_id": 22939,
        "date": "2025-05-01 11:56:36",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "🎉 EXCLUSIVE RaveDAO EVENT in Dubai for Crypto VIP Signal 🎉  \nWe're thrilled to announce an exclusive opportunity for our community!\n\n Be part of something big and experience the future of Web3 firsthand!\n\nBook Your Slot - https://app.plvr.io/events/32?aid=token2049\n\nDon’t miss out – let’s go RaveDAO! 💥\n\n#RaveDAO #Web3 #CryptoCommunity",
        "reply_to": null
    },
    {
        "message_id": 22938,
        "date": "2025-05-01 08:38:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "SEI continues to test the resistance area but has not yet succeeded. Let’s wait for a breakout above the resistance for new entries. However, we still expect a leg down towards the support area before any upward movement.\n\nSupport Area: $0.18-$0.182\n\nResistance Area: $0.213-$0.218",
        "reply_to": 22912
    },
    {
        "message_id": 22937,
        "date": "2025-05-01 08:28:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "SUI is having difficulty breaking through the resistance area and has been rejected multiple times. It may be a good idea to take profits on your long position at this point and wait for a retracement before considering new entries. For risky traders, opening a short position at the resistance level could be an option, but it's essential to use a tight stop loss to manage risk.\n\nSupport Area: $2.80-$2.90\n\nResistance Area: $3.53-$3.67",
        "reply_to": 22900
    },
    {
        "message_id": 22936,
        "date": "2025-05-01 05:50:41",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Bitcoin has broken the rising wedge downward and is now trying to reclaim it. The price is holding the support area for now, but it appears that sellers may take control. Keep a tight stop loss on all open positions.",
        "reply_to": 22929
    },
    {
        "message_id": 22934,
        "date": "2025-04-30 18:06:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "NOT analysis: \n\nPrice is trading within a downward channel and is now testing the resistance line. A long position should only be opened if the price breaks above the resistance line. A rejection from this point will likely push the price toward the support area.\n\nSupport Area: $0.001950-$0.0020\n\nResistance Area: $0.002750-$0.0028",
        "reply_to": 22933
    },
    {
        "message_id": 22933,
        "date": "2025-04-30 16:15:56",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "",
        "reply_to": null
    },
    {
        "message_id": 22932,
        "date": "2025-04-30 12:57:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "BTC spot volume delta (7D SMA) has taken a sharp downturn over the past three days, signaling increasing selling pressure:\n\n🔻Apr 27: -$30.9M  \n🔻Apr 28: -$76.1M  \n🔻Apr 29: -$193.4M  \n\nThis sustained negative trend suggests that aggressive sellers are currently dominating the market. The weakening spot demand could point to profit-taking, buyer exhaustion, or the early stages of a trend reversal. Caution is warranted as we approach key support zones.",
        "reply_to": null
    },
    {
        "message_id": 22931,
        "date": "2025-04-30 11:04:35",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "ORDI is currently retesting the area and has flipped it as support. All eyes are still on BTC, as a significant drop could spoil the party. You may open a small long position at the support area with a tight stop loss.\n\nSupport Area: $7.80-$8.10 \n\nResistance Area: $10.30-$10.80",
        "reply_to": 22904
    },
    {
        "message_id": 22930,
        "date": "2025-04-30 08:32:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "PENGU has broken through the resistance area and is now trading above it. We may see a retest of this zone, which is where you can open long positions. After some accumulation, a continuation of the upward movement may occur.\n\nSupport Area: $0.009000-$0.009570\n\nResistance Area: $0.0134-$0.0142",
        "reply_to": 22910
    },
    {
        "message_id": 22929,
        "date": "2025-04-30 05:54:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Bitcoin's rising wedge pattern remains intact, and we will see which direction it breaks. There is minimal buying pressure, and BTC has been rejected every time it approaches the $95,000 mark. Be prepared for a potential quick decline toward the $90,000 area.",
        "reply_to": 22923
    },
    {
        "message_id": 22928,
        "date": "2025-04-29 18:42:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "CGPT analysis: \n\nPrice is currently testing the resistance area, so let's see how it reacts. This area is not a trade zone, and it is better to wait for a better setup.\n\nSupport Area: $0.0824-$0.0870\n\nResistance Area: $0.1170-$0.1215",
        "reply_to": 22927
    },
    {
        "message_id": 22927,
        "date": "2025-04-29 16:08:18",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "",
        "reply_to": null
    },
    {
        "message_id": 22926,
        "date": "2025-04-29 12:18:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "ETH Hot Capital has seen a strong resurgence, climbing from a recent low of $2.60B on April 17 to $4.34B by April 28 — marking its highest point since March 26. This sharp rebound suggests renewed interest and capital flow into Ethereum, possibly indicating growing investor confidence or positioning ahead of potential catalysts.",
        "reply_to": null
    },
    {
        "message_id": 22925,
        "date": "2025-04-29 09:09:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "XLM analysis:\n\nThe price has broken out of the falling wedge pattern and is now gradually approaching the resistance area. If the price is able to break the resistance, we could see a continuation of the upward movement. Currently, this is not a trading zone, so it's better to wait for a while.\n\nSupport Area: $0.238-$0.246\n\nResistance Area: $0.300-$0.309",
        "reply_to": null
    },
    {
        "message_id": 22924,
        "date": "2025-04-29 09:08:24",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Beware of Fake Crypto Exchanges: A Common Scam You Should Know\nHow the Scam Works:\n\nAttractive Token Prices: Scammers create a fake exchange or clone a real one, showing unrealistically high prices for certain tokens (often 2x–10x more than the actual market price). This lures users into thinking they can make a big profit.\n\nDeposit Trap: Victims are told to transfer their tokens to this exchange to \"sell at a higher price.\" Everything looks normal — login, balance, charts, even customer support.\n\nWithdrawal Freeze: Once the user deposits tokens and tries to withdraw or sell, the exchange suddenly freezes the account, citing “KYC issues,” “suspicious activity,” or simply crashes/goes offline.\n\nNo Way Back: The user loses access to their funds permanently. There’s no real company or support — just scammers behind a fake front.",
        "reply_to": null
    },
    {
        "message_id": 22923,
        "date": "2025-04-29 06:57:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Bitcoin is currently trading around a support level, and on lower time frames, we are observing the formation of a rising wedge pattern. The rising wedge is generally considered a bearish signal, indicating that a downward breakout is likely. We may see a significant price movement soon, so it’s important to be prepared.",
        "reply_to": 22917
    },
    {
        "message_id": 22922,
        "date": "2025-04-28 18:07:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "GUN analysis:\n\nThere is a small uptrend line that acts as support, and the price is heading towards a major resistance area. A break above this resistance will propel the price to a new all-time high.\n\nResistance Area: $0.06700-$0.07135",
        "reply_to": 22921
    },
    {
        "message_id": 22921,
        "date": "2025-04-28 15:55:54",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "",
        "reply_to": null
    },
    {
        "message_id": 22920,
        "date": "2025-04-28 12:03:40",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "MicroStrategy has purchased 15,355 BTC on April 27 at an average price of $92,737, totaling approximately $1.42 billion.\n\nAnother massive accumulation from MicroStrategy!",
        "reply_to": null
    },
    {
        "message_id": 22919,
        "date": "2025-04-28 10:04:50",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Trump is expected to make a statement soon, which could trigger high volatility in the market. Stay prepared for sharp moves in either direction.",
        "reply_to": null
    },
    {
        "message_id": 22918,
        "date": "2025-04-28 08:19:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "This is why we wait for confirmations; MOVE is rejected from the resistance area. The price is moving towards the resistance area again, so let's see if it can break above it. The resistance level remains unchanged.\n\nSupport Area: $0.218-$0.223",
        "reply_to": 22906
    },
    {
        "message_id": 22917,
        "date": "2025-04-28 05:32:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Bitcoin is currently maintaining its support area. Let’s see how the market reacts when the US market opens. A break below this support area could lead to a quick sell-off.",
        "reply_to": 22911
    },
    {
        "message_id": 22916,
        "date": "2025-04-27 18:18:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "STX analysis: \n\nThe price has broken above the downtrend resistance line and is now gradually moving upward. The next resistance level is at $1, where we anticipate some profit-taking and selling activity. This is currently a no-trade zone, and we are waiting for a clear movement in either direction before considering new entry points.",
        "reply_to": 22915
    },
    {
        "message_id": 22915,
        "date": "2025-04-27 15:59:13",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "",
        "reply_to": null
    },
    {
        "message_id": 22914,
        "date": "2025-04-27 13:11:06",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Bitcoin’s current price is trading well above the average of all historical prices (cummean × 4.5), reflecting strong bullish sentiment across the market. Such significant deviations are often monitored by traders and investors to gauge the sustainability of the current trend and to anticipate potential corrections or continuations.",
        "reply_to": null
    },
    {
        "message_id": 22913,
        "date": "2025-04-27 11:12:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "LINK analysis: \n\nPrice is slowly approaching the resistance area. There is a small uptrend line that serves as a support area. Let's see if the price is able to break above the resistance area for new entries.\n\nResistance Area: $15.40-$15.90",
        "reply_to": null
    },
    {
        "message_id": 22912,
        "date": "2025-04-27 08:48:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "SEI has rejected the resistance area, and we may see a move toward the support area. We can open a long position at the support area. The support and resistance levels remain the same.",
        "reply_to": 22901
    },
    {
        "message_id": 22911,
        "date": "2025-04-27 06:06:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Bitcoin is maintaining its support level, but the volume remains low. A break below $93,000 would be bearish and could open the door to the $90,000 level. All eyes will be on Monday's opening.",
        "reply_to": 22905
    },
    {
        "message_id": 22910,
        "date": "2025-04-26 18:18:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "PENGU analysis: \n\nThe price is currently testing the resistance area. We will see if it can break above this level. If it does break through the resistance, it will indicate a bullish trend and the upward movement will continue. However, if the price is rejected at this point, it will likely fall back to the support zone.\n\nSupport Area: $0.007080-$0.007400\n\nResistance Area: $0.009000-$0.009570",
        "reply_to": 22909
    },
    {
        "message_id": 22909,
        "date": "2025-04-26 16:43:37",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "",
        "reply_to": null
    },
    {
        "message_id": 22908,
        "date": "2025-04-26 13:21:32",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Open Interest in Bitcoin perpetual swaps has climbed to 281K BTC, marking a +15.6% increase since early March. This rise indicates a growing build-up of leverage as prices recover, setting the stage for potentially heightened volatility driven by liquidations and stop-outs.",
        "reply_to": null
    },
    {
        "message_id": 22907,
        "date": "2025-04-26 10:57:55",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "CAKE has once again been rejected at the triangle resistance line. We are looking for a clear breakout before making any new entries. If the price drops below $1.75, it will indicate a bearish trend, and we will consider opening short positions. For any upward movement, the price needs to break above the $2.35 area.",
        "reply_to": 22893
    },
    {
        "message_id": 22906,
        "date": "2025-04-26 08:21:10",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "MOVE has reached the resistance area; let's see if the price can close above it. We will open a long position after getting some confirmations. There is no need to FOMO.\n\nNext Resistance Area: $0.286-$0.295",
        "reply_to": 22898
    },
    {
        "message_id": 22905,
        "date": "2025-04-26 06:27:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Bitcoin managed to break above the resistance area but was unable to sustain the $95,000 level. The weekend is upon us, and we might witness low-volume pumps and dumps. The opening of next week will determine the direction.",
        "reply_to": 22899
    },
    {
        "message_id": 22904,
        "date": "2025-04-25 18:21:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "ORDI analysis: \n\nThe price has broken out of the falling wedge pattern and surpassed the local resistance area. It is currently retesting this level, and if it can maintain its position above it, we could see a move toward the major resistance area. However, opening a long position at this point carries some risk because Bitcoin is at resistance. If we experience a rejection, alts may suffer further losses.\n\nLocal Support Area: $7.80-$8.10\n\nMajor Resistance Area: $10.30-$10.80",
        "reply_to": 22903
    },
    {
        "message_id": 22903,
        "date": "2025-04-25 16:01:36",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "",
        "reply_to": null
    },
    {
        "message_id": 22902,
        "date": "2025-04-25 14:06:15",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Bitcoin’s Short-Term Holder (STH) Profit/Loss Ratio has climbed back to the neutral 1.0 level, indicating an even split between coins held in profit and loss. Historically, this level tends to act as resistance during bearish periods, reflecting market hesitation. However, a clean and sustained break above this threshold could signal renewed confidence, stronger bullish momentum, and potentially mark the beginning of a broader recovery phase.",
        "reply_to": null
    },
    {
        "message_id": 22901,
        "date": "2025-04-25 11:29:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "SEI has broken the $0.18 level and is now heading towards the next resistance area. Let's see how the price reacts at this resistance area. A rejection from the resistance zone will send us back to the support zone.\n\nSupport Area: $0.18-$0.182\n\nResistance Area: $0.213-$0.218",
        "reply_to": 22853
    },
    {
        "message_id": 22900,
        "date": "2025-04-25 09:59:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "The SUI long position is now over 80% profitable in the spot market. You may want to book some profits here and hold the rest with a trailing stop loss. The price is currently attempting to break through the resistance area. There is a high likelihood that we might see a rejection and a subsequent move towards the support area.\n\nSupport Area: $2.80-$2.90",
        "reply_to": 22874
    },
    {
        "message_id": 22899,
        "date": "2025-04-25 05:27:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Bitcoin is attempting to break through the resistance area, but has not been successful so far. Sellers remain active in this region, and there are reports about ongoing discussions regarding traffic. We may experience high volatility in the market, so be prepared for significant moves in both directions. The support and resistance levels remain unchanged.",
        "reply_to": 22894
    },
    {
        "message_id": 22898,
        "date": "2025-04-24 18:11:16",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "MOVE analysis:\n\nThe price is currently fluctuating between the support and resistance areas. This zone is not ideal for trading. We are waiting for a breakout above the resistance area to confirm a potential reversal. Conversely, a break below the support area would likely lead to further downward movement.\n\nSupport Area: $0.2190-$0.2240\n\nResistance Area: $0.2480-$0.2530",
        "reply_to": 22897
    },
    {
        "message_id": 22897,
        "date": "2025-04-24 16:04:33",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "",
        "reply_to": null
    },
    {
        "message_id": 22896,
        "date": "2025-04-24 13:48:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "The Bitcoin liquidation heatmap reveals a significant cluster of liquidity sitting just below the $90,000 level. This suggests a potential magnet zone for price action, where the market could dip to liquidate late long positions before deciding its next move. All eyes now on whether BTC will flush out leverage or push higher with momentum. Stay cautious!",
        "reply_to": null
    },
    {
        "message_id": 22895,
        "date": "2025-04-24 11:46:13",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "The TOTAL cryptocurrency market capitalisation continues its upward movement as expected. The next key resistance level is around the $3 trillion mark, and a break of this level could generate more positivity and fear of missing out (FOMO) in the market. We may experience some sideways movement in the next couple of days.",
        "reply_to": 22842
    },
    {
        "message_id": 22894,
        "date": "2025-04-24 06:02:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Bitcoin has precisely rejected the resistance area that we previously discussed. The first support level to watch is at $90,000. If the price falls below this level, we could see a rapid decline towards the $88,000 to $88,400 range. The resistance area remains unchanged, so let's see if the price can break above it. The likelihood is high that we will revisit the $90,000 level before attempting to break the $95,000 mark.",
        "reply_to": 22887
    },
    {
        "message_id": 22893,
        "date": "2025-04-23 18:39:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "CAKE analysis:\n\nPrice is currently trading within a symmetric triangle, indicating it is a no-trading zone. The breakout from this triangle will determine the next move. Be attentive to support and resistance levels for potential new entries.\n\nSupport Area: $1.55-$1.65\n\nResistance Area: $2.25-$2.35",
        "reply_to": 22891
    },
    {
        "message_id": 22892,
        "date": "2025-04-23 18:26:07",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Perfect timing for those who followed the call!\n\n40% of the community grabbed BTC below $80K — just as we suggested during the dip — and it pumped right after!\n\nThis shows the power of buying in fear and trusting solid analysis. For those waiting below $75K — remember, the market doesn’t always give second chances. Stay alert!",
        "reply_to": 22835
    },
    {
        "message_id": 22891,
        "date": "2025-04-23 15:30:02",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "",
        "reply_to": null
    },
    {
        "message_id": 22890,
        "date": "2025-04-23 13:11:31",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Bitcoin has now broken above the Short-Term Holder realized price, often viewed as a key benchmark for market sentiment and positioning. This level currently sits around $93K, and historically, a sustained move above it has signaled renewed confidence, potentially acting as a launchpad for further upside.",
        "reply_to": null
    },
    {
        "message_id": 22889,
        "date": "2025-04-23 10:29:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "BONK has broken the resistance area, and we will see how it reacts there. We are waiting for confirmation before opening new trades. The price needs to flip this zone and establish it as a support area to continue the upward movement.",
        "reply_to": 22879
    },
    {
        "message_id": 22888,
        "date": "2025-04-23 08:21:24",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Ethereum (ETH) is currently testing a resistance area, and it's important to see if it can break above this level. If the price successfully breaks and holds above the $1,810 mark, we could see a move towards the key resistance area at $2,000. However, if there is a rejection at this level, the price may drop back to $1,500. The next two to three days will be crucial for determining the direction of ETH's movement.",
        "reply_to": 22802
    },
    {
        "message_id": 22887,
        "date": "2025-04-23 06:21:13",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Bitcoin continues to rise, having broken through the key level around $90,000. The price has now reached a major resistance area, and it will be interesting to see how it reacts there. The $90,000 level will now act as a support area, and we may see a retest of this zone. If the price breaks above $95,000, it is likely to generate more fear of missing out (FOMO) in the market.",
        "reply_to": 22880
    },
    {
        "message_id": 22886,
        "date": "2025-04-22 18:34:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "POL analysis:\n\nThe price has broken above the resistance area and is currently trading above it. We might see a retest of this level, and if the price can hold within this zone, we could anticipate a move upward. You can open a long position once the price retests the area.\n\nSupport Area: $0.1990-$0.2070\n\nResistance Area: $0.2465-$0.2570",
        "reply_to": 22885
    },
    {
        "message_id": 22885,
        "date": "2025-04-22 15:42:05",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "",
        "reply_to": null
    },
    {
        "message_id": 22884,
        "date": "2025-04-22 14:28:13",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Finally, Bitcoin has broken above the key psychological level of $90,000. This is a strong bullish signal, but now the focus shifts to whether it can sustain above this level or if we’ll see some profit booking kick in. Holding above $90K could pave the way for further upside, while a rejection might pull price back to retest the breakout zone. Keep an eye on volume and market sentiment in the next few sessions.",
        "reply_to": null
    },
    {
        "message_id": 22883,
        "date": "2025-04-22 13:44:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Educational Post \n\nWhat is Social Trading? \n\nSocial trading is a strategy that enables individuals to mimic the trading behavior of expert investors and market professionals, often in real time. It facilitates an environment of shared learning and knowledge exchange, where insights, trading decisions, and strategies can be followed and copied.\n\nIn the past, market analysis and trading decisions were largely individual activities, with solo investors scanning the markets, deciphering charts, and anticipating trends. The advent of social trading broke these barriers, providing a platform for traders to observe, follow, and learn from each other. Advanced technological platforms and digital tools have made social trading more accessible, bringing together communities with shared interests in financial markets.\n\nHow Does Social Trading Work?\n\nSocial trading operates via online platforms that compile the profiles of numerous traders, showcasing their trading strategies, performance metrics, risk levels, and other relevant details. As a participant, you can search through these profiles, follow traders that align with your investment goals, and replicate their trades in your portfolio.\n\nMany social trading platforms provide real-time and interactive experiences and include features like news feeds, forums, and chats. These features add a layer of social interaction, letting you engage in discussions, share opinions, and even form trading collaborations.\n\nSocial Trading Risks\n\nDespite its advantages, social trading comes with its own risks. There's always a possibility that the trader you're following might incur losses, impacting your portfolio. Additionally, a degree of knowledge and understanding of the financial markets is essential to assess the strategies and performance of potential traders to follow.\n\nAlso, over-reliance on others' strategies can limit your ability to make independent investment decisions and hinder the development of personal trading skills.\n\nSocial Trading vs. Copy Trading\n\nMany consider copy trading a form of social trading. Although both strategies tap into the collective knowledge of the trading community, they differ in their approach. Social trading creates a platform for traders to connect, observe, and learn from others' tactics and insights.\n\n It enables an interactive environment just like a social network where traders share their views and strategies, providing a pool of information from which traders can draw to inform their own trading decisions. It combines community learning and individual control, as each trader ultimately decides how to apply the acquired knowledge in their own trading.\n\nWhereas social trading encourages individual decision-making, copy trading directly clones the trades of another successful trader in real time. Traders pick a peer they deem successful from a platform, automatically duplicating all their transactions into their own trading account. \n\nThis strategy expedites the trading process as it eliminates the need for manually executing each trade. Thus, your trading strategy becomes an exact mirror of the copied trader's moves. In contrast to social trading, copy trading provides a more guided approach, directly reflecting another trader's strategies.",
        "reply_to": null
    },
    {
        "message_id": 22882,
        "date": "2025-04-22 11:41:11",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "According to Glassnode, Ethereum is currently trading below the lower MVRV Price Band — a zone that has historically marked the best buying opportunities. This suggests that ETH may be undervalued at current levels, and long-term investors could see this as an attractive entry point. Historically, dips into this range have preceded significant upside moves.",
        "reply_to": null
    },
    {
        "message_id": 22881,
        "date": "2025-04-22 08:46:16",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "SOL Analysis:\n\nThe price is forming an Inverse Head & Shoulders (IH&S) pattern on the daily time frame. There is a high likelihood that we will see a move towards the support area for further accumulation. Currently, the price is at the resistance area. Consider adding some SOL near the support level.\n\nSupport Area: $114 - $120\n\nResistance Area: $142 - $148",
        "reply_to": null
    },
    {
        "message_id": 22880,
        "date": "2025-04-22 05:28:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Bitcoin has maintained its position above $86,000 and continues to move upward. We are now entering a major resistance zone, so it will be interesting to see how the price reacts in this area. Significant selling pressure and profit-taking occur in the $88,500 to $90,000 range. If the price breaks above $90,000, we could see a substantial upward movement. The support level remains unchanged.",
        "reply_to": 22873
    },
    {
        "message_id": 22879,
        "date": "2025-04-21 17:36:25",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "BONK analysis:\n\nPrice is currently trading within the support and resistance zone. This area is considered a no-trade zone, so it's better to observe which direction the range breaks. You can engage in scalping with a tight stop loss while within the range.\n\nSupport Area: $0.00000890-$0.00000960\n\nResistance Area: $0.00001520-$0.00001565",
        "reply_to": 22878
    },
    {
        "message_id": 22878,
        "date": "2025-04-21 15:52:49",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "",
        "reply_to": null
    },
    {
        "message_id": 22877,
        "date": "2025-04-21 12:46:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "According to Glassnode data, whales sharply increased their Solana (SOL) purchases last week, signaling renewed interest and confidence from large investors. This surge in accumulation often precedes significant price movements, as big players position themselves ahead of potential bullish momentum. It's a development worth watching closely as market sentiment around SOL appears to be shifting.",
        "reply_to": null
    },
    {
        "message_id": 22876,
        "date": "2025-04-21 12:05:54",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "JUST IN: MicroStrategy has purchased 6,556 BTC between April 14 and April 20 at an average price of $84,785, totaling approximately $555.80 million.\n\nMichael Saylor remains relentless in his Bitcoin strategy, continuing to double down despite recent market volatility.",
        "reply_to": null
    },
    {
        "message_id": 22875,
        "date": "2025-04-21 09:41:13",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "DOGS has successfully held the support area, bouncing back more than 21% from that point. Currently, it is testing the local resistance zone, and if it breaks above this level, it could continue moving upward. The support level remains unchanged.\n\nSupport Area: $0.000100-$0.0001040\n\nResistance Area: $0.0001230-$0.0001260% Rally?",
        "reply_to": 22839
    },
    {
        "message_id": 22874,
        "date": "2025-04-21 08:21:51",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "SUI has tested the support area and bounced back from it. The price is gradually moving upward, and we may see a continuation of this upward trend. The downtrend line acts as a resistance area, and breaking above it could bolster the market's strength. It's advisable to use a stop loss just below the support area.",
        "reply_to": 22854
    },
    {
        "message_id": 22873,
        "date": "2025-04-21 05:39:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Bitcoin has finally broken through the resistance area and is now trading above it. This is a positive sign, and if the price can hold above this level, we may see some upward movement. The new support level is around $86,000.Bitcoin has finally broken through the resistance area and is now trading above it. This is a positive sign, and if the price can hold above this level, we may see some upward movement. The new support level is around $86,000.",
        "reply_to": 22857
    },
    {
        "message_id": 22872,
        "date": "2025-04-20 18:26:12",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "#JWIF is holding strong above horizontal support here on higher timeframe \n\nAlso The falling wedge has officially formed and it’s now testing the base. This is a textbook type breakout setup🚀\n\nHigh conviction, high reward. The window’s open — don’t be late to the move🔥\n\nBUY ON MEXC: https://www.mexc.com/exchange/JWIF_USDT\n\nBUY ON BINGX: https://bingx.com/en/spot/JWIFUSDT/",
        "reply_to": 22866
    },
    {
        "message_id": 22871,
        "date": "2025-04-20 17:51:13",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "ICP analysis:\n\nPrice is testing the support area. Let's see if it can hold this area or not. A break below this support area will bring heavy selling in the market. \n\nSupport Area: $4.48-$5.00",
        "reply_to": 22862
    },
    {
        "message_id": 22870,
        "date": "2025-04-20 17:23:39",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "#JWIF IS READY TO EXPLODE like anything 🚀\n\nMemecoins are waking up and showing early sign of strength this is your chance to buy in accumulation phase before 5x-10x rally \n\nDon’t be a sideliner Just buy and hold it on #BingX 🚀\n\nhttps://bingx.com/en/spot/JWIFUSDT/",
        "reply_to": null
    },
    {
        "message_id": 22869,
        "date": "2025-04-20 17:05:55",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Best time to buy #JWIF is now \n\n#JWIF is preparing for a rally the world has never seen. This price isn’t a dip — it’s a gift shaped by global turmoil What you’re witnessing is a price due to tariff war \n\nJust buy and hold this for moonshot which is inevitable 🚀",
        "reply_to": null
    },
    {
        "message_id": 22868,
        "date": "2025-04-20 17:03:52",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Why is #JWIF is a must buy here \n\n#JWIF is heavily undervalued meme coin available in the market with a strong community\n\nAlso #JWIF team announced massive partnership coming within few days which will definitely ignite massive rally fo it anytime 🚀\n\n🔗 TWEET: https://x.com/Jerrywifcoin/status/1914001857963254076?t=ewtWgnjmmd1pkg-QjVhDSg&s=19",
        "reply_to": null
    },
    {
        "message_id": 22867,
        "date": "2025-04-20 17:02:09",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "#JWIF/USDT\n\nLooks ready for a triangle breakout on the 8H timeframe, also forming a strong double bottom pattern.\n\nIt looks like the accumulation phase is over, and the chart is shaping up for a monster breakout.\n\nA massive 5x-10x rally could start at any moment — don’t miss it!\n\nGET IN NOW🚀✌️",
        "reply_to": null
    },
    {
        "message_id": 22866,
        "date": "2025-04-20 17:00:31",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Buying #JWIF here on MEXC: \nhttps://www.mexc.com/exchange/JWIF_USDT\n\nFormation of falling wedge pattern on higher timeframe and looks like it’s bottomed out here \n\nR:R looks very good here✌️\n\nExpecting breakout anytime soon so buy and hold it for moonshot 🚀\n\nShort term targets: +500%",
        "reply_to": null
    },
    {
        "message_id": 22862,
        "date": "2025-04-20 15:10:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "",
        "reply_to": null
    },
    {
        "message_id": 22861,
        "date": "2025-04-20 13:05:02",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "The digital asset market has seen significant declines during this liquidity-sensitive drawdown. Bitcoin dropped from $83.5k to $74.5k, losing $150 billion in market cap. Ethereum fared even worse, falling from $1800 to $1380, with a $40 billion market cap reduction.",
        "reply_to": null
    },
    {
        "message_id": 22860,
        "date": "2025-04-20 11:10:44",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": null,
        "reply_to": 22859
    },
    {
        "message_id": 22858,
        "date": "2025-04-20 09:45:22",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "BEL gave a clean candle close and gave a drop below the 12.8% and reached the Major Support Zone. Now we can expect some strong pullback, in market remains stable. \n\nMajor Support Zone : $0.44 - $0.46",
        "reply_to": 22851
    },
    {
        "message_id": 22857,
        "date": "2025-04-20 07:04:20",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Bitcoin now going though the sideways and very slow movement in the market, trying to mov up in a curve. Also, with that the resistance is also standing strong. Monday Market Open might come with the some volume in the market.",
        "reply_to": 22852
    },
    {
        "message_id": 22856,
        "date": "2025-04-19 17:51:24",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Educational Post \n\nWhat Is Binance Megadrop?\n\nBinance Megadrop is a token launch platform that combines elements of Binance Simple Earn and the Binance Web3 Wallet to create an innovative airdrop experience. The platform is designed to provide users with early access to new token projects and a variety of ways to earn rewards. With Binance Megadrop, users can subscribe to fixed-term products, complete Web3 quests, and receive token rewards proportional to their accumulated scores.\n\nKey Features of Binance Megadrop\n\n1. Early access to token projects\n\nOne of the main features of Binance Megadrop is giving users early access to selected Web3 projects before their official listing on the Binance exchange. This allows users to get involved in promising projects at an early stage, potentially benefiting from future growth and development.\n\n2. Integration with Binance Simple Earn\n\nBinance Megadrop is closely integrated with Binance Simple Earn, a feature that allows users to earn rewards by locking their BNB in fixed-term products. By subscribing to these locked products, users accumulate points that determine their reward allocation in the Megadrop program. The longer the lock period and the more BNB locked, the higher the score and potential rewards.\n\n3. Engagement through Web3 quests\n\nAnother significant aspect of Binance Megadrop is the inclusion of Web3 quests. These quests are designed to engage users and encourage them to learn more about the blockchain ecosystem. By completing tasks within their Binance Web3 Wallet, users can boost their scores and earn additional rewards.",
        "reply_to": null
    },
    {
        "message_id": 22855,
        "date": "2025-04-19 13:26:05",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Bitcoin’s current on-chain data reveals an interesting dynamic: Short-Term Holders are now sitting on significant unrealized losses, especially when normalized by the percentage drawdown. Historically, this kind of capitulation behavior aligns with early-stage bear market conditions — when weak hands begin to feel the pressure. While price hasn’t broken down aggressively, the pain among recent buyers suggests that sentiment is fragile and any further downside could trigger stronger reactions. It’s a crucial time to watch for either deeper corrections or signs of a reversal as stronger hands potentially step in.",
        "reply_to": null
    },
    {
        "message_id": 22854,
        "date": "2025-04-19 11:29:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "SUI Analysis:\n\nThe price has been rejected from the triangle trendline and is currently testing the support area. There is also a small uptrend line that is acting as support. You can consider opening a long position at the support area, with a tight stop loss set below the $2.00 level.\n\nSupport Area: $2.05 - $2.11  \n\nResistance Area: $2.50 - $2.55",
        "reply_to": null
    },
    {
        "message_id": 22853,
        "date": "2025-04-19 08:04:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "SEI is currently having difficulty maintaining the trendline, which is why we are waiting for a candle to close above $0.18 for confirmation. There hasn’t been a clear movement yet, so we’ll see if the price can break through the resistance. If it gets rejected at this level, the price may drop toward the support area around $0.155.",
        "reply_to": 22826
    },
    {
        "message_id": 22852,
        "date": "2025-04-19 06:08:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Bitcoin is gradually trending upwards but remains within a specific range. We may soon witness a breakout of this range, which will determine the next movement. The trading volume is low due to the weekend, and we expect more activity on Monday.",
        "reply_to": 22847
    },
    {
        "message_id": 22851,
        "date": "2025-04-18 17:24:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "BEL analysis:\n\nPrice is currently testing the support area; let's see if it can hold this level. A break below the support area will likely lead to increased selling in the market. It is advisable to wait for some time before opening new trades.\n\nKey Level to Hold: $0.52",
        "reply_to": 22850
    },
    {
        "message_id": 22850,
        "date": "2025-04-18 14:46:21",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "",
        "reply_to": null
    },
    {
        "message_id": 22849,
        "date": "2025-04-18 12:45:23",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "FLOKI move 12% in profits but now its again back to the support, showing potentially sign for the up move. Further it forming a Inverse Head & Shoulder Pattern and print a new Higher High.",
        "reply_to": 22803
    },
    {
        "message_id": 22848,
        "date": "2025-04-18 09:34:30",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "LISTA gave a new higher high and attempted to push and break over the resistance now. Structure looks bullish and can give a buy trade once closing over the $0.21 level.",
        "reply_to": 22817
    },
    {
        "message_id": 22847,
        "date": "2025-04-18 05:29:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Bitcoin continues to trade within a range and has not shown much progress yet. The key resistance and support levels remain unchanged. If it breaks above the $86,000 mark, the price could move toward the $88,000 resistance area. The stock market is also providing mixed signals, and we might see a breakout in either direction by next week.",
        "reply_to": 22840
    },
    {
        "message_id": 22846,
        "date": "2025-04-17 18:11:19",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "ARB analysis:\n\nThe price is currently finding support at the uptrend line. We may see a movement toward the resistance area, and it will be interesting to see if the price can break through this level. Conversely, if the price drops below the uptrend line, it could lead to a new low.\n\nResistance Area: $0.311-$0.318",
        "reply_to": 22844
    },
    {
        "message_id": 22845,
        "date": "2025-04-17 16:18:33",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "🇺🇸🇨🇳 President Trump says the US will make a deal with China.\n\nWith tensions easing and positive developments on the horizon, we may see a relief rally across global markets. Keep an eye on key resistance zones as sentiment begins to shift!",
        "reply_to": null
    },
    {
        "message_id": 22844,
        "date": "2025-04-17 16:05:32",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "",
        "reply_to": null
    },
    {
        "message_id": 22843,
        "date": "2025-04-17 14:09:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Bitcoin’s realized cap has hit a new all-time high of $872 billion, reflecting sustained capital inflows into the network. However, monthly growth has slowed to just +0.9%, signaling that while accumulation continues, investor appetite is cooling. This trend points to a more cautious, risk-off sentiment prevailing in the market despite record valuation metrics.",
        "reply_to": null
    },
    {
        "message_id": 22842,
        "date": "2025-04-17 12:12:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "The TOTAL crypto marketcap broke the falling wedge pattern upward and also retested it. We may see a continuation of the upward movement in the coming days.",
        "reply_to": 22808
    },
    {
        "message_id": 22841,
        "date": "2025-04-17 10:01:22",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "ONDO's price has rejected the resistance area. Wait for a clear breakout above this resistance level or a test of the support area for new entries. The support and resistance levels remain the same.",
        "reply_to": 22824
    },
    {
        "message_id": 22840,
        "date": "2025-04-17 06:26:12",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Bitcoin experienced a quick drop before the Federal Reserve Chair's speech but managed to hold the support level at $83,000. The key resistance level to watch is between $85800 and $86,000. We'll see if the price can break above this resistance. It has been trading within a range for the past couple of days, and a breakout may be imminent. Let's see which direction the price breaks from this trading range.",
        "reply_to": 22833
    },
    {
        "message_id": 22839,
        "date": "2025-04-16 17:39:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "DOGS analysis:\n\nThe price is currently at the support area, and we'll see if it can hold this level. The downtrend is ongoing, and there are no signs of a reversal yet. If the price breaks below the support area, it will likely lead to increased selling.\n\nSupport Area: $0.000100-$0.0001040",
        "reply_to": 22837
    },
    {
        "message_id": 22837,
        "date": "2025-04-16 15:51:40",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "",
        "reply_to": null
    },
    {
        "message_id": 22836,
        "date": "2025-04-16 13:03:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Bitcoin Accumulation Update:  \n\nBitcoin’s Accumulation Trend Score has reached 0.34 — the highest level so far this year. This indicates that, overall, wallets are beginning to shift back into accumulation mode. Notably, larger investor cohorts appear to be stepping in modestly, even amid recent price weakness, suggesting renewed confidence and potential long-term positioning.",
        "reply_to": null
    },
    {
        "message_id": 22835,
        "date": "2025-04-16 11:54:45",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "",
        "reply_to": null
    },
    {
        "message_id": 22834,
        "date": "2025-04-16 09:41:10",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "DOGE Analysis:\n\nThe price is currently trading within a falling wedge pattern and is adhering to both support and resistance lines. A breakout from this pattern will determine the next movement. The critical level to surpass is $0.18, and we are only considering new entries if the price holds above this level.\n\nSupport Area: $0.134 - $0.142",
        "reply_to": null
    },
    {
        "message_id": 22833,
        "date": "2025-04-16 04:55:57",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Bitcoin was unable to close above the $86,000 level and subsequently dropped from there. The price has now reached the $83,000 support area, which needs to hold. If it fails to do so, we could see further declines. Federal Reserve Chairman Powell will speak today at 5:30 PM UTC, which is likely to lead to quick price fluctuations. Be prepared for this.",
        "reply_to": 22825
    },
    {
        "message_id": 22832,
        "date": "2025-04-15 17:41:23",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "DYDX analysis:\n\nPrice bounced from the support area, but there is no sign of strength yet. We may see another test of this support area, and let's see if the price can hold above it or not.\n\nSupport Area: $0.494-$0.5090\n\nResistance Area: $0.768-$0.824",
        "reply_to": 22831
    },
    {
        "message_id": 22831,
        "date": "2025-04-15 16:18:08",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "",
        "reply_to": null
    },
    {
        "message_id": 22830,
        "date": "2025-04-15 13:39:50",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Is MEXC Exchange Playing Dirty? \"Risk Control\" or Fund Freeze Tactics?\nWhat’s Happening?\n\nSeveral users have reported that MEXC exchange is freezing their funds under the label of “Risk Control”, with little to no explanation or resolution.\n\n\nHere’s How It Goes Down:\n\n-User deposits & trades normally.\n\n-Suddenly, withdrawals are blocked and assets are frozen.\n\n-MEXC sends a vague message:\n\"Your account is under risk control. Please wait for further review.\"\n\n-No clear timeline, no support response — just silence.\n\n\nPossible Red Flags:\n\n-Lack of transparency on why funds are held.\n\n-No prior warning before freezing assets.\n\n-KYC issues or volume trading sometimes falsely flagged.\n\nUsers forced to wait days or weeks — some never get funds back.\n\nWhy This Is Concerning:\n\n-Trust is key in crypto.\n\n-Centralized exchanges must offer transparency and user protection.\n\n-Labeling withdrawals as \"risk control\" without due process is abuse of power.\n\nTips to Protect Yourself:\n\n-Avoid keeping large funds on any centralized exchange like MEXC .\n\n-Use exchanges with better reputation and transparency.\n\n-Withdraw profits regularly — not your keys, not your coins.\n\n-Always document all your trades and transactions.",
        "reply_to": null
    },
    {
        "message_id": 22829,
        "date": "2025-04-15 13:30:09",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Beware of Fake Crypto Exchanges: A Common Scam You Should Know\nHow the Scam Works:\n\nAttractive Token Prices: Scammers create a fake exchange or clone a real one, showing unrealistically high prices for certain tokens (often 2x–10x more than the actual market price). This lures users into thinking they can make a big profit.\n\nDeposit Trap: Victims are told to transfer their tokens to this exchange to \"sell at a higher price.\" Everything looks normal — login, balance, charts, even customer support.\n\nWithdrawal Freeze: Once the user deposits tokens and tries to withdraw or sell, the exchange suddenly freezes the account, citing “KYC issues,” “suspicious activity,” or simply crashes/goes offline.\n\nNo Way Back: The user loses access to their funds permanently. There’s no real company or support — just scammers behind a fake front.",
        "reply_to": null
    },
    {
        "message_id": 22827,
        "date": "2025-04-15 13:10:39",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Solana’s URPD shows a major shift in cost basis over the past two days, forming the largest supply cluster (>5%) at $129.79 with over 32M SOL. This zone could act as a support during future drawdowns, reflecting high investor engagement at this price level.",
        "reply_to": null
    },
    {
        "message_id": 22826,
        "date": "2025-04-15 11:27:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "SEI has broken out of the falling wedge pattern in an upward direction, which is a positive sign. The price is currently attempting to breach the major resistance area. A close above the $0.18 level would be bullish and could trigger a significant upward rally. Be sure to wait for confirmation before opening any new trades.",
        "reply_to": 22807
    },
    {
        "message_id": 22825,
        "date": "2025-04-15 06:26:19",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Bitcoin is attempting to break through the $85,800 to $86,000 range, but it has been rejected from this level multiple times. The downside support level remains unchanged. As the US market opens, there's uncertainty, and no clear direction is evident. A break below the $83,000 level could trigger significant selling in the market.",
        "reply_to": 22819
    },
    {
        "message_id": 22824,
        "date": "2025-04-14 17:32:51",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "ONDO analysis:\n\nPrice is currently testing the resistance area, so it's better to wait for a clear breakout before making new entries. A rejection from this resistance area will likely cause the price to return to the support zone.\n\nSupport Area: $0.7550-$0.7770\n\nResistance Area: $0.9100-$0.9570",
        "reply_to": 22823
    },
    {
        "message_id": 22823,
        "date": "2025-04-14 16:02:47",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "",
        "reply_to": null
    },
    {
        "message_id": 22822,
        "date": "2025-04-14 12:38:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "According to Glassnode, wallets holding between 1,000 and 10,000 BTC have been accumulating at an accelerated pace over the past 30 days. This suggests that smart money and institutional players are quietly building positions despite the broader market uncertainty.",
        "reply_to": null
    },
    {
        "message_id": 22821,
        "date": "2025-04-14 12:20:58",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Strategy has acquired 3,459 BTC at an average price of $82,618, totaling approximately $285.8 million.\n\nThis move signals continued confidence in Bitcoin at current levels, even amidst market volatility. Strategic accumulation like this from major players often reflects long-term bullish sentiment.",
        "reply_to": null
    },
    {
        "message_id": 22820,
        "date": "2025-04-14 10:36:15",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "CHR has broken the support trendline, which is a negative sign. We may see another test of the resistance area; let's observe how it reacts there.",
        "reply_to": 22811
    },
    {
        "message_id": 22819,
        "date": "2025-04-14 06:13:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Bitcoin broke the rising wedge pattern downward, as expected. The price dropped to $83,000 and bounced from there. However, it is unable to break the resistance line. Let's see how the market reacts when the US market opens.",
        "reply_to": 22812
    },
    {
        "message_id": 22818,
        "date": "2025-04-14 03:10:23",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "$OM just crashed 90% in under an hour — over $5.5B in market cap wiped out instantly.\n\nDUMP REASON:\n 1. Team Resignation: Reports suggest the Kabal team behind $OM resigned right before the crash. Just after the news, over $590M worth of $OM was moved to exchanges, pointing to a likely massive insider sell-off.\n\n 2. Supply Control Rumors: Allegedly, the team held 90% of the total supply. With such concentrated control, the risk of OTC dumps and sudden liquidation was dangerously high.\n\nOutcome:\n • Airdrop holders got completely rekt.\n • Long-term investors are left holding the bag.\n • Community faced the brunt of what looks like insider exit liquidity.\n\nThis situation highlights the danger of projects with zero transparency, poor tokenomics, and centralized supply.",
        "reply_to": null
    },
    {
        "message_id": 22817,
        "date": "2025-04-13 17:58:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "LISTA analysis:\n\nPrice is currently attempting to break through the resistance area but was rejected in the first attempt. A break above this resistance zone could lead to significant upward movement. Conversely, if the price falls below the support area, we may observe a new low.\n\nSupport Area: $0.1430-$0.1560\n\nResistance Area: $0.1980-$0.2180",
        "reply_to": 22816
    },
    {
        "message_id": 22816,
        "date": "2025-04-13 15:31:21",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "",
        "reply_to": null
    },
    {
        "message_id": 22815,
        "date": "2025-04-13 12:34:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Recent data shows that nearly all altcoin sectors have experienced significant declines over the past few months. Ethereum, in particular, has been at the forefront of this broader downturn, shedding more than 60% of its value since late December. This sharp drop has sparked growing concerns among investors and analysts about the potential formation of a bear market across the altcoin space. The sustained downtrend is fueling caution, and many are now watching closely for signs of a broader market reversal or further capitulation.",
        "reply_to": null
    },
    {
        "message_id": 22814,
        "date": "2025-04-13 11:36:22",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "",
        "reply_to": null
    },
    {
        "message_id": 22813,
        "date": "2025-04-13 09:38:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "RUNE has bounced off the support area and has also broken through the resistance line. We may see a continuation of the upward movement. You can consider opening a long position during the retest around the $1.10 area. Additionally, you might want to add more to your position if the price drops back to the support area.\n\nResistance Area: $1.30-$1.33",
        "reply_to": 22785
    },
    {
        "message_id": 22812,
        "date": "2025-04-13 07:32:35",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Bitcoin continues to rise, but we shouldn't place too much trust in the weekend surge. There is a rising wedge pattern forming on the lower time frames, which is bearish in nature. A downward break from this pattern could lead to a target around the $83,000 level. The market opening on Monday will be a crucial factor in determining the direction for the upcoming week.",
        "reply_to": 22806
    },
    {
        "message_id": 22811,
        "date": "2025-04-12 18:02:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "CHR analysis:\n\nThe price is approaching a key resistance level, which needs to be broken for an upward rally to occur. If the price is rejected at this level, it may lead to a continued downturn and the potential formation of a new low. Additionally, there is a small uptrend line that serves as a support area. Currently, this is not a favorable trading zone, so it would be wise to wait for some time before making any moves.\n\nKey Resistance Area: $0.087-$0.0923",
        "reply_to": 22810
    },
    {
        "message_id": 22810,
        "date": "2025-04-12 16:01:12",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "",
        "reply_to": null
    },
    {
        "message_id": 22809,
        "date": "2025-04-12 12:39:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Since the collapse of FTX in November 2022, Bitcoin has shown significantly stronger recovery and investor confidence compared to Ethereum. Bitcoin's realized cap — a metric reflecting the value of coins based on the price at which they last moved — has surged by $468 billion, marking a 117% increase. In contrast, Ethereum’s realized cap has risen by just $61 billion, or 32% over the same period.",
        "reply_to": null
    },
    {
        "message_id": 22808,
        "date": "2025-04-12 10:41:04",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "The TOTAL cryptocurrency market capitalization has bounced back after testing the support line. The price is currently testing the resistance line, and if it breaks above this level, we could witness a strong upward rally. However, if the price is rejected at this point, it will likely move back within the current pattern. The local support level is set at $2.5 trillion.",
        "reply_to": 22763
    },
    {
        "message_id": 22807,
        "date": "2025-04-12 09:18:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "SEI has broken through the local resistance area and is now heading towards the major resistance level of the falling wedge pattern. A break above the pattern will create positive sentiments and trigger an upward rally.\n\nMajor Resistance Area: $0.1800",
        "reply_to": 22800
    },
    {
        "message_id": 22806,
        "date": "2025-04-12 06:19:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Bitcoin broke the resistance area and retested it. The weekend is here, and we may see slow, sideways movement. Let's see how the market reacts on Monday.",
        "reply_to": 22801
    },
    {
        "message_id": 22805,
        "date": "2025-04-11 17:54:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "XLM analysis:\n\nThe daily chart shows a falling wedge pattern, and the price is currently testing a key resistance area. If the price breaks above this local resistance, it will likely move towards the resistance line of the falling wedge pattern. We will wait for a breakout of the falling wedge before opening new positions.\n\nResistance Area: $0.2380-$0.2460",
        "reply_to": 22804
    },
    {
        "message_id": 22804,
        "date": "2025-04-11 15:34:40",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "",
        "reply_to": null
    },
    {
        "message_id": 22803,
        "date": "2025-04-11 12:22:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "FLOKI has broken through the resistance area and is now trading above it. Let's wait for a few more confirmations before opening new trades. The key level remains unchanged.",
        "reply_to": 22796
    },
    {
        "message_id": 22802,
        "date": "2025-04-11 08:41:25",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Ethereum (ETH) has managed to regain the $1500 level, which is a positive sign. However, sellers remain quite active, so we need to see if the price can hold above this key $1500 level. The market is displaying mixed signals amidst the ongoing tariff war.\n\nNext Resistance Area: $1760-$1800",
        "reply_to": 22787
    },
    {
        "message_id": 22801,
        "date": "2025-04-11 07:05:41",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Bitcoin has failed to hold the support area and is now retesting. Let's see if the price can break above this level. A rejection here will send the price back below the $80,000 level.",
        "reply_to": 22797
    },
    {
        "message_id": 22800,
        "date": "2025-04-10 17:23:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "SEI analysis:\n\nThe price has broken downward through the pattern and has also retested it. There is a small uptrend line that serves as a support area; if the price breaks below this line, it will likely move toward a new low. It’s advisable to wait for some time before opening new positions.\n\nSupport Area: $0.1400",
        "reply_to": 22799
    },
    {
        "message_id": 22799,
        "date": "2025-04-10 16:37:00",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "",
        "reply_to": null
    },
    {
        "message_id": 22798,
        "date": "2025-04-10 13:04:57",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "STEEM had a very quick move to the upside with the overall market recovery. Price now,faking strong rejecting from the Resistance area as mentioned. If candle close with huge today, then we can expect to price to drop lower towards its previous low and new lower low.",
        "reply_to": 22760
    },
    {
        "message_id": 22797,
        "date": "2025-04-10 05:21:16",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Bitcoin has finally broken through the resistance area, thanks to the tariff being paused for 90 days. We might see a retest of this area, and if the price manages to hold above it, we could experience a continuation of the upward movement. Conversely, if the price breaks below the support area, it could lead to renewed selling in the market.\n\nSupport Area: $81,300-$81,500",
        "reply_to": 22786
    },
    {
        "message_id": 22796,
        "date": "2025-04-09 18:12:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "FLOKI analysis:\n\nThe price is currently testing the resistance area, so we will see if it can break above it. We will open a new position only after we receive confirmation. If there is a rejection at this level, the price may drop back toward a new low.\n\nResistance Area: $0.00005240-$0.00005400",
        "reply_to": 22791
    },
    {
        "message_id": 22795,
        "date": "2025-04-09 17:52:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "JUST IN: 🇺🇸 Massive Relief Rally!\n\nOver $3.5 Trillion added to the US Stock Market after the announcement of 90-day Tariff Pause (excluding China).  \n\nGlobal markets reacting positively to this development as fear of prolonged trade war temporarily cools down.  \n\n🔸 US Indices Pumping  \n🔸 Asian & European Markets Rebounding  \n🔸 Bitcoin & Crypto Market showing signs of recovery  \n\nBut remember — The Tariff on China has been raised to 125% — So the uncertainty still remains for global markets in the mid-term.  \n\nStay safe & trade with proper risk management!",
        "reply_to": null
    },
    {
        "message_id": 22794,
        "date": "2025-04-09 17:49:13",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": null,
        "reply_to": 22792
    },
    {
        "message_id": 22793,
        "date": "2025-04-09 17:35:44",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "🚨 BREAKING NEWS🚨  \n\n90 Days Pause on Tariffs for All Countries — Except China!\n\nMeanwhile, the Tariff on China has been immediately raised to 125% by the US Government.  \n\nThis is a clear signal of escalating trade war tensions between US & China.  \n\nMarket reaction will be highly volatile — stay cautious in your trades.",
        "reply_to": null
    },
    {
        "message_id": 22792,
        "date": "2025-04-09 16:47:05",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "🚀 FUN Signal Update\n\nFUN price made a high of $0.008630 today — delivering over 300% profit with 10x leverage!\n\nWhile the entire market was crashing due to the tariff news, our team spotted the perfect setup and nailed it within just a few hours.\n\nWe shared only 1 signal — and it smashed our targets flawlessly.\n\nThis is the power of quality over quantity.\n\nPin our channel on top and stay tuned for more opportunities!",
        "reply_to": 22781
    },
    {
        "message_id": 22791,
        "date": "2025-04-09 16:08:56",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "",
        "reply_to": null
    },
    {
        "message_id": 22790,
        "date": "2025-04-09 15:25:57",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "",
        "reply_to": 22781
    },
    {
        "message_id": 22789,
        "date": "2025-04-09 13:24:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "XRP’s Profit/Loss Ratio has been on a steady decline since January — signaling growing weakness in the market.  \n\nFewer traders are locking in profits while more are sitting on losses — a classic sign of fading conviction among holders.  \n\nWealth is shifting into new hands, creating a top-heavy structure that often leaves the market vulnerable to sharp corrections.  \n\nCaution is advised until a strong reversal signal appears.",
        "reply_to": null
    },
    {
        "message_id": 22788,
        "date": "2025-04-09 11:16:49",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "🚨 BREAKING: CHINA TO IMPOSE ADDITIONAL 84% TARIFFS ON U.S. GOODS 🇨🇳🇺🇸  \n\nGlobal trade war tensions are escalating rapidly!  \n\nThis fresh move from China comes as a direct response to the recent tariff hikes announced by the U.S.  \n\nMarkets are expected to remain highly volatile — stay safe and manage your positions carefully!",
        "reply_to": 22784
    },
    {
        "message_id": 22787,
        "date": "2025-04-09 08:53:01",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Ethereum (ETH) was unable to maintain its support level and experienced a significant decline. Unfortunately, it has also broken through the key $1,500 level and is currently trading below it. The price has dropped to levels not seen since March 2023, and there is considerable selling pressure in the market. To attract some buying pressure, the price needs to reclaim the $1,500 level.",
        "reply_to": 22740
    },
    {
        "message_id": 22786,
        "date": "2025-04-09 06:08:56",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Bitcoin has struggled to break through the resistance level and has dropped from that point. There is still significant liquidity positioned below $74,000, and we might see a dip below this level. The trade war between the US and China is ongoing, and there have been no positive developments so far.",
        "reply_to": 22772
    },
    {
        "message_id": 22785,
        "date": "2025-04-08 18:27:22",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "RUNE analysis:\n\nPrice is currently at the support area, and the triangle pattern is nearing a decision point. The break of this pattern will determine the next move. Let’s wait for some time and see which direction the market takes.\n\nSupport Area: $0.963-$1.03",
        "reply_to": 22778
    },
    {
        "message_id": 22784,
        "date": "2025-04-08 18:01:25",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "🚨 BREAKING: Reports indicate that the White House has confirmed — President Trump is set to hike tariffs on China to 104%, which will take effect at midnight tonight.\n\nThis aggressive move is likely to create high volatility across global markets. Stay alert — risk management is key during such uncertain times!",
        "reply_to": null
    },
    {
        "message_id": 22783,
        "date": "2025-04-08 17:38:35",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "#FUN is set for a monster rally🚀\n\nDarvas box breakout is the sign of a 2x move in altcoins\n\nThis could be your perfect entry point so don’t let this slip away✌️☑️",
        "reply_to": 22780
    },
    {
        "message_id": 22782,
        "date": "2025-04-08 17:10:16",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Why #FUN is a must buy here \n\n#FUN pumped hard during the tariff war while the global markets were collapsing shows the unstoppable strength🔥\n\nAlso #FUN team announced incredibly bullish roadmap packed with alot of bullish stuffs and massive partnerships things will turn very bullish for #FUN ANYTIME soon🚀\n\n🔗Tweet: https://x.com/FUNtoken_io/status/1909653351270129974",
        "reply_to": null
    },
    {
        "message_id": 22781,
        "date": "2025-04-08 17:03:35",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Buying #FUN here on Binance: \nhttps://www.binance.com/en/trade/FUN_USDT\n\nDouble Bottom formation on 1H timeframe signaling a major reversal ahead🚀\n\nThis setup mirrors a previous fractal that triggered a massive rally few days ago. If you missed that breakout, here’s your second chance to get in before the next big move🔥\n\nShort term targets: 10%-30%-50%",
        "reply_to": null
    },
    {
        "message_id": 22780,
        "date": "2025-04-08 17:01:09",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "#FUN/USDT\n\nLOOKS READY FOR A MASSIVE BREAKOUT AFTER more than two years of consolidation inside Darvas box\n\nThe accumulation phase is finally over, and the chart is setting up for a monster move.\n\nDon’t miss out – a 2x rally is right around the corner and could ignite at any time.\n\nGET IN NOW🚀✌️",
        "reply_to": null
    },
    {
        "message_id": 22779,
        "date": "2025-04-08 16:30:31",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Less than 30 minutes left🚀\n\nA strong TA/FA based BINANCE call coming at 5PM GMT today!🔥\n\nExchange: BINANCE\n\nGet ready for a 2X ride🚀",
        "reply_to": null
    },
    {
        "message_id": 22778,
        "date": "2025-04-08 16:08:12",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "",
        "reply_to": null
    },
    {
        "message_id": 22777,
        "date": "2025-04-08 14:30:07",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": null,
        "reply_to": 22775
    },
    {
        "message_id": 22776,
        "date": "2025-04-08 14:23:42",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Over the past 7 days, we have seen a sharp surge in futures trading volume across most major crypto assets. Bitcoin ($BTC) futures volume jumped by 64%, while Ethereum ($ETH) saw a 58% increase. XRP recorded an impressive 78% rise, and Solana ($SOL) futures volume also climbed by 58%.  \n\nThis sudden spike in futures activity marks a clear reversal from the previous month’s trend, where futures volumes were steadily declining. Increased futures volume often signals rising market participation and could lead to higher volatility in the coming days.",
        "reply_to": null
    },
    {
        "message_id": 22775,
        "date": "2025-04-08 14:16:38",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "BTC holding strong above $75k even after alot of fud also double bottom formation on the 1D timeframe so get ready—altcoins are about to explode anytime and we're going to share a strong breakout call🚀\n\nStay tuned for a strong TA FA based call at 5PM GMT today!🔥\n\nExchange: BINANCE✌️",
        "reply_to": null
    },
    {
        "message_id": 22774,
        "date": "2025-04-08 12:03:04",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "SUI was unable to reclaim the triangle trendline, which caused the price to drop from that point. This illustrates the importance of waiting for confirmation. Currently, the price is testing the resistance area, and we will see if it can break above it. A breakthrough above $2.10 could lead to further upward movement.",
        "reply_to": 22746
    },
    {
        "message_id": 22773,
        "date": "2025-04-08 07:42:43",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "KAIA has been rejected from the resistance area and has broken the support trendline. The price has reached a new low, and we might see a test of the trendline soon. Currently, there is no trading zone, so we are waiting for a close above the resistance area before considering new positions.",
        "reply_to": 22751
    },
    {
        "message_id": 22772,
        "date": "2025-04-08 05:22:29",
        "sender_id": -1001312345502,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Yesterday, Bitcoin experienced a significant drop due to a decline in the global market. However, it recovered when the US market opened. Despite this recovery, the overall market remains bearish, and the price faced rejection in the $81,300-$81,500 resistance area. For Bitcoin to maintain an upward trend, it needs to break through this level; otherwise, we may see a decline toward the $78,000 area.",
        "reply_to": 22761
    }
]