[
    {
        "message_id": 683,
        "date": "2025-04-25 16:37:09",
        "sender_id": -1001606583538,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Altcoins should stay strong in the upcoming days. A select few of them have a much higher chance to pump significantly. \n\nAll the coins we post will be part of the coins we believe have that extra chance of doing massive moves in the short term. \n\nIn order to maintain stability in the coins we hold and only if needed, our team will support the prices of all our signals. \n\nThis market is for buying, holding and waiting until the coin makes it's big move.",
        "reply_to": null
    },
    {
        "message_id": 682,
        "date": "2025-04-25 15:36:08",
        "sender_id": -1001606583538,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Our short term target for $TUT should be around 70% higher from here.",
        "reply_to": null
    },
    {
        "message_id": 681,
        "date": "2025-04-25 15:10:56",
        "sender_id": -1001606583538,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "🛎 Buying $TUT here. 🛎\n\nThis coin is currently only at 23m $ market and owned by Binance.\nThere is a very high chance of seeing a big move to the upside on it during this bull market. \n\nThe potential is huge, buy and hold it for massive profits.",
        "reply_to": null
    },
    {
        "message_id": 680,
        "date": "2025-04-25 15:10:49",
        "sender_id": -1001606583538,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "",
        "reply_to": null
    },
    {
        "message_id": 679,
        "date": "2025-04-25 14:40:20",
        "sender_id": -1001606583538,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Market is looking good today, seeing a lot of good opportunities in the market.",
        "reply_to": null
    },
    {
        "message_id": 678,
        "date": "2025-04-18 14:02:17",
        "sender_id": -1001606583538,
        "first_name": null,
        "last_name": null,
        "username": null,
        "message": "Hello everyone, in the past, we have been scheduling our signals to be posted at a specific time which allowed us to get massive volumes and high percentage gains very quickly. This strategy has worked for us many times in the past and allowed our members to generate millions of $ in profits over the last few years. However, the market has changed lately and we realize we need to change our strategy.\n\nFrom now on, all our signals will be posted at random times without any prior notice. Whenever we see a good buying opportunity in the market, we will post it and allow our members to generate great profits quickly as well. This will allow our members to get a better entry in all our signals and allow the signals to grow organically with the market. Our team will be actively supporting all our signals as well to maximize profits for our community.\n\nStay tuned.",
        "reply_to": null
    }
]